import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class CountryCodesService {

  arabCountryCodes:string[] = [
    "+973",  // البحرين
    "+20",   // مصر
    "+213",  // الجزائر
    "+963",  // سوريا
    "+962",  // الأردن
    "+965",  // الكويت
    "+961",  // لبنان
    "+218",  // ليبيا
    "+212",  // المغرب
    "+968",  // عمان
    "+970",  // فلسطين
    "+974",  // قطر
    "+966",  // السعودية
    "+249",  // السودان
    "+963",  // سوريا
    "+216",  // تونس
    "+971",  // الإمارات العربية المتحدة
    "+967",  // اليمن
    "+964",  // العراق
    "+222",  // موريتانيا
    "+252"   // الصومال
  ];

  
  constructor() { }
}
